Repository: bmcage/cocreationplanet
Catalog: utils/translations_*.po
Languages: nl

source: Go on a co-creation journey
nl: Ga op een co-creatie reis

source: Use the co-creation planet to explore the
nl: Gebruik de co-creatie planeet om de stappen

source: steps of Design Thinking in a natural way.
nl: van Design Thinking op natuurlijke wijze te ontdekken.

source: You have a
nl: Je hebt een

source: challenge
nl: uitdaging

source: the topic you seek to solve in 1-2 sentences.
nl: het onderwerp dat je wil oplossen in 1-2 zinnen.

source: Then embark on a design thinking journey
nl: Ga dan op een design thinking reis

source: with our co-creation planet. Through this
nl: met onze co-creatie planeet. Via deze reis

source: journey, you work towards a specific outcome.
nl: werk je naar een specifiek resultaat.

source: Describe this outcome in generic terms before
nl: Omschrijf dit resultaat dat je wil vooraleer

source: you start your journey.
nl: je van start gaat met je reis.

source: 1. EMPATHIZE
nl: 1. INLEVEN

source: & UNDERSTAND
nl: & BEGRIJPEN

source: 2. DEFINE
nl: 2. DEFINIËREN

source: & IDEATE
nl: & IDEE VORMING

source: 3. RAPID
nl: 3. SNELLE

source: & ITERATION
nl: & ITERATIE

source: 4. SHARING
nl: 4. DELEN

source: 5. RESPOND
nl: 5. REAGEREN

source: & DELIVER
nl: & OPLEVEREN

source: PLANET
nl: PLANEET

source: METAPHOR
nl: METAFOOR

source: In this
nl: In dit

source: 1st continent
nl: 1e continent

source: explore (diverge) and understand, rather than
nl: exploreer (divergeer) en begrijp, in plaats van

source: simply assume, what the problem of your
nl: te veronderstellen, wat het probleem is in jouw

source: project is and how to solve it yourself.
nl: project, en hoe het zelf op te lossen.

source: This continent involves, for example, speaking
nl: Dit continent omvat bij voorbeeld spreken met,

source: to and spending time with people who are
nl: en tijd doorbrengen met, mensen die beinvloed

source: affected by the circumstances of the topic.
nl: worden door de omstandigheden van het ondwerp.

source: It contains countries (Empathising, Exploring)
nl: Het bevat landen (inleven, ontdekken)

source: that are concepts you want to learn through
nl: welke concepten zijn die je wil leren door het

source: travelling through several cities (tools) spread
nl: reizen via verschillende steden (hulpmiddelen)

source: out in broad regions.
nl: die zich bevinden in grote regios.

source: 2nd continent
nl: 2e continent

source: you can process the insights gathered in the
nl: kun je de inzichten bekomen in het eerste

source: 1st continent (Discover) and help you define
nl: continent (ontdek) verwerken, wat je helpt deze

source: them (narrow down / converge).
nl: te definiëren (versmallen scope / convergeren).

source: You can visit countries that deal with
nl: Je kan landen bezoeken die helpen bij het

source: Contextualising and Setting Criteria for your project.
nl: contextualiseren en criteria zetten voor uw project.

source: 3rd continent
nl: 3e continent

source: encouraged to give different answers (diverge again!)
nl: aangemoedigd om verschillende antwoorden (terug

source: to the defined problem seeking inspiration
nl: divergeren) van het proleem, waarbij je inspiratie zoekt

source: from elsewhere and co-designing with a
nl: vanuit diverse invalshoeken en je co-design doet

source: range of different people. This is a continent
nl: met verschillende personen. Dit is een continent

source: that allows again to expand/diverge in your
nl: dat je toelaat weer de expanderen.divergen binnen

source: already selected ideas from the previous
nl: je geselecteerde ideeën uit de eerdere continenten/

source: continents/phases. This includes the countries
nl: fazen. Dit continent omvat de landen

source: of Ideating for Solutions, Prototyping, and Testing
nl: Ideeën voor Oplossingen, Prototyping, en Testen

source: while Developing. Enjoy this fun continent!
nl: tijdens Ontwikkelen. Geniet van dit tof continent!

source: This
nl: Dit

source: 4th continent
nl: 4e continent

source: out different solutions at small-scale, rejecting
nl: verschillende oplossingen uit in kleine schaal, verwerpt

source: those that will not work and improving the ones that will.
nl: die die niet werken, en verbetert die die dat wel doen

source: What do other people think of your work?
nl: Wat denken andere mensen van je werk?

source: In this 5th and final continent (Deliver phase)
nl: In dit 5e en finale continent (Oplever Fase)

source: you think how you take this project to the next level,
nl: denk je na hoe je dit project naar een hoger niveau kunt

source: or how you can promote it and present to the
nl: brengen, of hoe je het kunt promoten en presenteren

source: clients, and sustain it in the marketplace!
nl: naar cliënten. Kan het op eigen benen staan?

source: This is a phase where you focus on (that is, converge)
nl: Dit is de fase waar je focust op (dus convergeert naar)

source: your final solution development.
nl: je finale oplossing.

source: What changes can you do based on the feedback?
nl: Welke aanpassingen kun je doen op basis van de feedback?

source: BACK
nl: TERUG

source: TO
nl: NAAR

source: EMPATHISE
nl: INLEVEN

source: COUNTRY
nl: LAND

source: UNDERSTAND
nl: BEGRIJPEN

source: In this country you can find cities (tools)
nl: In dit land kun je steden (tools) vinden

source: that help you develop empathy with the
nl: die je helpen om empathie te ontwikkels met de

source: users of your project, as well as, with your
nl: gebruikers van je project, alsook met je team,

source: team members on a human level. This
nl: op een menselijk niveau. Dit land helpt je

source: country is about training mainly your
nl: je zachte/interpersoonlijke talenten te

source: soft/interpersonal skills.
nl: trainen.

source: In this country you can find tools (cities)
nl: In dit land vind je hulpmiddelen (stden)

source: that help you explore and understand
nl: die je helpen exploreren en begrijpen

source: how to manage, organise, and frame
nl: hoe je project en team te managen,

source: your project and team on a structural
nl: organiseren en framen. Ook op een

source: level. This country is mainly about
nl: structureel niveau. Dit land helpt je

source: training your organisational skills.
nl: organisatorische talenten trainen.

source: DISCOVER
nl: ONTDEK

source: HIGH
nl: HOGE

source: IMMERSION
nl: IMMERSIE

source: REGION
nl: REGIO

source: LOW
nl: LAGE

source: External resource link
nl: Externe link

source: Example
nl: Voorbeeld

source: AUDIENCE
nl: PUBLIEK

source: DEFINING
nl: DEFINIËREN

source: CHALLENGES
nl: UITDAGINGEN

source: LITERATURE
nl: LITERATUUR

source: SEARCH
nl: ZOEKTOCHT

source: IDEATION
nl: IDEEËN

source: DEFINE
nl: DEFINIËREN

source: In this country, you can visit different cities (tools)
nl: In dit land kun je verschillende steden (tools) bezoeken

source: that can help you work out your project in more detail
nl: die je kunnen helpen met het uitwerken van je project

source: by, for example, identifying the specific research
nl: in meer detail, bv, het specifieke onderzoeksprobleem

source: problem and question you want to tackle from
nl: identificeren dat je wil aanpakken uit de vele die

source: the many that you have explored in the
nl: je hebt bekeken in de eerste faze (Ontdek).

source: first phase (Discover). You also define the
nl: Je definieert ook de criteria waarop je project

source: criteria your project should be based on.
nl: zou moeten gebaseerd zijn.

source: In this country, you can find cities (tools)
nl: In dit land vind je de steden (tools) terug die

source: that can help you start generate ideas
nl: je kunnen helpen bij het genereren van

source: for solutions.
nl: ideeën voor oplossingen.

source: MAPPING OUT
nl: IN KAART BRENGEN

source: FIND THEMES
nl: VIND THEMA'S

source: & INSIGHTS
nl: & INZICHTEN

source: SETTING CRITERIA
nl: CRITERIA ZETTEN

source: BRAINSTORMING
nl: BREINSTORMEN

source: ITERATION
nl: ITERATIE

source: In this country, you can find cities (tools) that help
nl: In dit land vind je steden (tools) die helpen bij

source: you develop your prototype, that is, an early sample,
nl: het uitwerken van je prototype, dat is, een eerste model

source: model or release of a product built to test a concept or process.
nl: of product uitwerking om een concept of proces te testen.

source: PROTYPING
nl: PROTOTYPEREN

source: LOW FIDELITY
nl: LAGE GETROUWHEID

source: HIGH FIDELITY
nl: HOGE GETROUWHEID

source: SHARING
nl: DELEN

source: PREPARE TO SHARE
nl: KLAARMAKEN VOOR DELEN

source: SHARE
nl: DEEL

source: SOLLICIT
nl: VRAAG OM

source: FEEDBACK REGION
nl: FEEDBACK REGIO

source: ANALYZE
nl: ANALYSEREN

source: DELIVER
nl: OPLEVEREN

source: RESPOND
nl: REAGEREN

source: In this country, you can find cities (tools) that help you with
nl: In dit land kun je steden (tools) terugvinden die helpen bij

source: responding to the feedback you had from the users. Be sure to check
nl: het reageren op feedback die je kreeg van gebruiken. Zorg dat

source: and test with your users several times before moving on!
nl: je verschillende keren test met je gebruikers vooraleer verder te gaan!

source: In this country, you can find cities (tools) to help you unlock the
nl: In dit land kun je steden (tools) vinden die je helpen het potentieel

source: potential of your project by sharing the result in a more permanent
nl: van je project te maximalizeren door het te delen op een meer

source: way. Like this the result can live on after your journey as finished!
nl: permanente maier. Zo kan het resultaat verderleven als het voor jou af is!

source: In this country, you can find cities (tools) on how to deliver the
nl: In dit land vind je steden (tools) over hoe je resultaat af te leveren

source: result to the teacher.
nl: aan de leerkracht.

source: REACT ON
nl: REAGEER OP

source: FINAL TESTING
nl: FINALE TESTEN

source: PREPARING FOR
nl: VOORBEREIDEN VOOR

source: PRESENTING REGION
nl: PRESENTEREN REGIO

source: PITCHING REGION
nl: PITCHING -REGIO
